xml-v4/DataProcessors/TL_ПросмотрСверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>TL_ПросмотрСверки</Name>
			<Comment>Просмотр TL_СверкаПакета с фильтрами по периоду и статусу; подсветка расхождений</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

xml-v4/InformationRegisters/TL_СоответствиеИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>TL_СоответствиеИсточников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СсылкаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПоследнегоПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХешПоследнегоПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодАЗС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОСЭНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TL_ТипОбъектаИсточника</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникUUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml-v4/InformationRegisters/TL_СверкаПакета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>TL_СверкаПакета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокНСИ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЦБ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_ЦБ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_БП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расхождение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TL_СтатусПакета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодАЗС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОСЭНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml-v4/InformationRegisters/TL_ОшибкиЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>TL_ОшибкиЗагрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсточникUUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TL_ТипОбъектаИсточника</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TL_ПолеОшибки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TL_КодОшибкиЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml-v4/Enums/TL_ТипОбъектаИсточника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>TL_ТипОбъектаИсточника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчётОРозничныхПродажах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПКО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентаризация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оприходование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускБлюд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребованиеНакладная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml-v4/DataProcessors/TL_ПросмотрСверки/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обработка TL_ПросмотрСверки, Форма
// Просмотр РегистрСведений.TL_СверкаПакета для бухгалтера ГИГ.
//
// Реквизиты формы (для сборки):
//   ДатаНачала                - Дата (DateTime)
//   ДатаОкончания             - Дата (DateTime)
//   ФильтрСтатус              - Строка(50)
//   ФильтрИдентификаторПакета - Строка(36)
//   Результат                 - ТаблицаЗначений (заполняется кодом)
//
// Параметры формы (для открытия из других мест):
//   ФильтрИдентификаторПакета - если передан, открывается с этим фильтром
//
// Команды:
//   ОбновитьСписок            → Обновить()
//   ОчиститьФильтры           → ОчиститьФильтры()
//   ПоказатьОшибкиПакета      → ПоказатьОшибкиПакета()
//   ПоказатьДокументыПакета   → ПоказатьДокументыПакета()
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
	ДатаНачала    = НачалоДня(ДатаОкончания - 7 * 24 * 60 * 60);
	Если Параметры.Свойство("ФильтрИдентификаторПакета") И ЗначениеЗаполнено(Параметры.ФильтрИдентификаторПакета) Тогда
		ФильтрИдентификаторПакета = Параметры.ФильтрИдентификаторПакета;
		ДатаНачала = '00010101';
		ДатаОкончания = '39991231';
	КонецЕсли;
	УстановитьУсловноеОформление();
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();

	// «Принято целиком» → светло-зелёный
	ДобавитьПравилоОформления("Результат.Статус", "ПринятоЦеликом",
		WebЦвета.СветлоЗеленый, Истина);

	// «Принято частично» → светло-жёлтый
	ДобавитьПравилоОформления("Результат.Статус", "ПринятоЧастично",
		WebЦвета.СветлоЖелтый, Истина);

	// «Отклонено» → светло-красный
	ДобавитьПравилоОформления("Результат.Статус", "Отклонено",
		WebЦвета.МистическаяРоза, Истина);

	// Расхождение > 0.01 → подсветка колонки Расхождение красным
	Эл = УсловноеОформление.Элементы.Добавить();
	От = Эл.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	От.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Результат.Расхождение");
	От.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	От.ПравоеЗначение = 0.01;
	Эл.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.МистическаяРоза);
	Эл.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , Истина));
	Пол = Эл.Поля.Элементы.Добавить();
	Пол.Поле = Новый ПолеКомпоновкиДанных("РезультатРасхождение");
КонецПроцедуры

&НаСервере
Процедура ДобавитьПравилоОформления(ИмяПоля, Значение, Цвет, ВсяСтрока = Ложь)
	Эл = УсловноеОформление.Элементы.Добавить();
	От = Эл.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	От.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	От.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	От.ПравоеЗначение = Значение;
	Эл.Оформление.УстановитьЗначениеПараметра("ЦветФона", Цвет);
	Пол = Эл.Поля.Элементы.Добавить();
	Если ВсяСтрока Тогда
		Пол.Поле = Новый ПолеКомпоновкиДанных("Результат");
	Иначе
		Пол.Поле = Новый ПолеКомпоновкиДанных("Результат" + СтрЗаменить(ИмяПоля, "Результат.", ""));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписок(Команда) Экспорт
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьФильтры(Команда) Экспорт
	ФильтрСтатус = "";
	ФильтрИдентификаторПакета = "";
	ДатаОкончания = КонецДня(ТекущаяДата());
	ДатаНачала    = НачалоДня(ДатаОкончания - 7 * 24 * 60 * 60);
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкиПакета(Команда) Экспорт
	ТекСтрока = Элементы.Результат.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Сообщить("Выберите строку пакета");
		Возврат;
	КонецЕсли;
	ПараметрыОткрытия = Новый Структура("ФильтрИдентификаторПакета", ТекСтрока.ИдентификаторПакета);
	ОткрытьФорму("Обработка.TL_ПросмотрОшибок.Форма.Форма", ПараметрыОткрытия);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДокументыПакета(Команда) Экспорт
	ТекСтрока = Элементы.Результат.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Сообщить("Выберите строку пакета");
		Возврат;
	КонецЕсли;
	// Открыть стандартный список регистра TL_СоответствиеИсточников с фильтром по пакету
	// (фильтр передать через параметр строки навигационной ссылки)
	ПерейтиПоНавигационнойСсылке(
		"e1cib/list/РегистрСведений.TL_СоответствиеИсточников?"
		+ "Filter.ИдентификаторПоследнегоПакета=" + ТекСтрока.ИдентификаторПакета);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьНаСервере()
	// Поля КодАЗС, НомерСмены, ДатаСмены, ОСЭНомер появились в TL_СверкаПакета
	// с переходом на формат пакета v2 (пакет = смена). Если колонки отсутствуют
	// в Результат-таблице формы (Form.xml ещё не обновлён), ЗаполнитьЗначения
	// тихо пропустит лишние поля выборки.
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	СвП.ИдентификаторПакета КАК ИдентификаторПакета,
		|	СвП.ВремяЗагрузки КАК ВремяЗагрузки,
		|	СвП.Источник КАК Источник,
		|	СвП.ПериодС КАК ПериодС,
		|	СвП.ПериодПо КАК ПериодПо,
		|	СвП.СтрокНСИ КАК СтрокНСИ,
		|	СвП.СтрокДокументов КАК СтрокДокументов,
		|	СвП.СуммаЦБ КАК СуммаЦБ,
		|	СвП.СуммаБП КАК СуммаБП,
		|	СвП.Расхождение КАК Расхождение,
		|	СвП.Статус КАК Статус,
		|	СвП.Комментарий КАК Комментарий,
		|	СвП.КодАЗС КАК КодАЗС,
		|	СвП.НомерСмены КАК НомерСмены,
		|	СвП.ДатаСмены КАК ДатаСмены,
		|	СвП.ОСЭНомер КАК ОСЭНомер,
		|	ЕСТЬNULL(ОшСч.Ошибок, 0) КАК Ошибок,
		|	ЕСТЬNULL(ДокСч.ДоктовБП, 0) КАК ДоктовБП
		|ИЗ
		|	РегистрСведений.TL_СверкаПакета КАК СвП
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|		(ВЫБРАТЬ
		|			ИдентификаторПакета КАК ИдентификаторПакета,
		|			КОЛИЧЕСТВО(*) КАК Ошибок
		|		ИЗ РегистрСведений.TL_ОшибкиЗагрузки
		|		СГРУППИРОВАТЬ ПО ИдентификаторПакета) КАК ОшСч
		|		ПО СвП.ИдентификаторПакета = ОшСч.ИдентификаторПакета
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|		(ВЫБРАТЬ
		|			ИдентификаторПоследнегоПакета КАК ИдентификаторПакета,
		|			КОЛИЧЕСТВО(*) КАК ДоктовБП
		|		ИЗ РегистрСведений.TL_СоответствиеИсточников
		|		ГДЕ Тип В (
		|			ЗНАЧЕНИЕ(Перечисление.TL_ТипОбъектаИсточника.Поступление),
		|			ЗНАЧЕНИЕ(Перечисление.TL_ТипОбъектаИсточника.ОтчётОРозничныхПродажах),
		|			ЗНАЧЕНИЕ(Перечисление.TL_ТипОбъектаИсточника.ПКО),
		|			ЗНАЧЕНИЕ(Перечисление.TL_ТипОбъектаИсточника.Перемещение),
		|			ЗНАЧЕНИЕ(Перечисление.TL_ТипОбъектаИсточника.Списание),
		|			ЗНАЧЕНИЕ(Перечисление.TL_ТипОбъектаИсточника.Инвентаризация),
		|			ЗНАЧЕНИЕ(Перечисление.TL_ТипОбъектаИсточника.Оприходование),
		|			ЗНАЧЕНИЕ(Перечисление.TL_ТипОбъектаИсточника.ВыпускБлюд),
		|			ЗНАЧЕНИЕ(Перечисление.TL_ТипОбъектаИсточника.ТребованиеНакладная))
		|		СГРУППИРОВАТЬ ПО ИдентификаторПоследнегоПакета) КАК ДокСч
		|		ПО СвП.ИдентификаторПакета = ДокСч.ИдентификаторПакета
		|ГДЕ
		|	СвП.ВремяЗагрузки МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И (&БезФильтраСтатуса ИЛИ СвП.Статус = &ФильтрСтатус)
		|	И (&БезФильтраПакета ИЛИ СвП.ИдентификаторПакета = &ФильтрИдентификаторПакета)
		|УПОРЯДОЧИТЬ ПО
		|	СвП.ДатаСмены УБЫВ, СвП.КодАЗС, СвП.ВремяЗагрузки УБЫВ";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ФильтрСтатус", ФильтрСтатус);
	Запрос.УстановитьПараметр("БезФильтраСтатуса", ПустаяСтрока(ФильтрСтатус));
	Запрос.УстановитьПараметр("ФильтрИдентификаторПакета", ФильтрИдентификаторПакета);
	Запрос.УстановитьПараметр("БезФильтраПакета", ПустаяСтрока(ФильтрИдентификаторПакета));

	Результат.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;

	// Итоги
	ИтогРасхождение = 0;
	ИтогСуммаЦБ = 0;
	ИтогСуммаБП = 0;
	КолПринятоЦеликом = 0;
	КолПринятоЧастично = 0;
	КолОтклонено = 0;
	Для Каждого Стр Из Результат Цикл
		ИтогРасхождение = ИтогРасхождение + Стр.Расхождение;
		ИтогСуммаЦБ = ИтогСуммаЦБ + Стр.СуммаЦБ;
		ИтогСуммаБП = ИтогСуммаБП + Стр.СуммаБП;
		Если Стр.Статус = "ПринятоЦеликом" Тогда
			КолПринятоЦеликом = КолПринятоЦеликом + 1;
		ИначеЕсли Стр.Статус = "ПринятоЧастично" Тогда
			КолПринятоЧастично = КолПринятоЧастично + 1;
		ИначеЕсли Стр.Статус = "Отклонено" Тогда
			КолОтклонено = КолОтклонено + 1;
		КонецЕсли;
	КонецЦикла;

	Элементы.КоличествоПакетов.Заголовок =
		"Найдено пакетов: " + Результат.Количество()
		+ "    |    Целиком: " + КолПринятоЦеликом
		+ "  Частично: " + КолПринятоЧастично
		+ "  Отклонено: " + КолОтклонено;

	Если Элементы.Найти("ИтогиСумм") <> Неопределено Тогда
		Элементы.ИтогиСумм.Заголовок =
			"Итого сумма ЦБ: " + Формат(ИтогСуммаЦБ, "ЧДЦ=2; ЧРГ=' '")
			+ "    Итого сумма БП: " + Формат(ИтогСуммаБП, "ЧДЦ=2; ЧРГ=' '")
			+ "    Итого расхождение: " + Формат(ИтогРасхождение, "ЧДЦ=2; ЧРГ=' '");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
